      * FIRST PROGRAM                                                   
       identification division.
       program-id. hello.
       data division.
       working-storage section.
       procedure division.
           display "Hello World"
       STOP RUN.
   
       